Model: "ChemVAE"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_mol_SMILES (InputLayer)   (None, 109, 35)      0                                            
__________________________________________________________________________________________________
encoder (Model)                 [(None, 128), (None, 229724      input_mol_SMILES[0][0]           
__________________________________________________________________________________________________
property_predictor (Model)      [(None, 2), (None, 1 6767        encoder[1][2]                    
__________________________________________________________________________________________________
reg_property_pred (Lambda)      (None, 2)            0           property_predictor[1][0]         
__________________________________________________________________________________________________
logit_property_pred (Lambda)    (None, 1)            0           property_predictor[1][1]         
__________________________________________________________________________________________________
decoder (Model)                 (None, 109, 35)      68554       encoder[1][2]                    
==================================================================================================
Total params: 305,045
Trainable params: 302,371
Non-trainable params: 2,674
__________________________________________________________________________________________________
